{
  "id": "gladdenme/factory-workers-daily-performance-attrition-s",
  "id_no": 2245197,
  "datasetSlugNullable": "factory-workers-daily-performance-attrition-s",
  "ownerUserNullable": "gladdenme",
  "usabilityRatingNullable": 1.0,
  "titleNullable": "Factory Workers’ Daily Performance & Attrition",
  "subtitleNullable": "Data with rich causal relationships, for testing machine-learning approaches",
  "descriptionNullable": "This synthetic dataset contains 18 months’ worth of daily performance and attrition data (411,948 observations) for a factory whose organizational structure comprises 508 workers. Due to employee turnover, a total of 687 persons appear in the dataset. The dataset’s observations cover both regular daily events (like workers’ attendance and daily level of Efficacy) and special one-time events (like accidents, an employee’s termination, or the onboarding of a new employee). A unique feature of the dataset is diverse causal relationships “hidden” within the data that are waiting to be uncovered through machine learning. For example, one might apply machine learning to investigate:\n- How a worker’s high level of performance increases the likelihood that he or she will be “hired away” to a better job by a competing company.\n- How a worker’s mental lapses or physical accidents may indicate that he or she is becoming sick and may soon miss a day of work due to illness.\n- How workers’ Efficacy is influenced by the day of the week, day of the month, and month of the year.\n- How workers’ age impacts their average daily Efficacy.\n- How workers’ average daily Efficacy is influenced by the difference in age between them and their supervisor.\n- How a worker’s average daily Efficacy is influenced by whether he or she is working primarily with teammates of the same or opposite sex.\n- How the number of “Teamwork” and “Disruption” behaviors displayed by workers and recorded by their managers is influenced by the day of the month (and, e.g., the stress caused by impending production deadlines).\n- How workers can be classified into groups with high, moderate, or low daily Efficacy that is either relatively stable or highly variable.\n\nThe dataset was prepared using [Synaptans WorkforceSim](https://pypi.org/project/workforcesim) version 0.3.15.\n\n# Types of observations\nEach row of the dataset reflects a single “event” that occurred on a particular day in relation to a particular worker. It’s possible for a given worker to have more than one event (and row) for the same day; for example, a worker might have “Presence”, “Efficacy”, and “Teamwork” events on the same day, with each event reflecting a different qualitative or quantitative aspect of the person’s performance. There are 14 types of events reflected in the dataset:\n- A “Presence” event indicates that a particular worker showed up for work on the given day, while an “Absence” event indicates that the worker failed to show up on a day when he or she was scheduled to work.\n- An “Efficacy” event reflects the degree of efficiency and productivity that an employee demonstrated over the course of the given workday. There are two related elements: the actual Efficacy that the employee generated on the given day, and the recorded Efficacy that the worker’s supervisor entered into the factory’s HRM/ERP system for the employee for that day. The employee’s actual Efficacy (a float with four post-decimal digits, such as 0.9548) is a “hidden” variable whose precise value isn’t known to the employee’s manager. Instead, the manager observes the employee over the course of the day and, at the end of the workday, enters into the HRM/ERP system an estimated value for the worker’s Efficacy. Such estimated values have only one post-decimal digit (e.g., 0.9). Some managers are better than others at estimating their employees’ Efficacy scores – but no supervisor is perfect. For example, if an employee worked with an Efficacy of 0.8437 on a given day, his or her manager could easily record an estimated value of 0.8 or 0.9 or (less likely) even 0.7 or 1.0. Workers who feel as though their managers are consistently mis-recording their Efficacy levels may eventually become inclined to quit their jobs.\n- A “Resignation” event indicates that on the given date, an employee quit his or her job (i.e., the employee experienced a voluntary separation). After resigning, the employee was no longer a part of the workforce and did not generate any future behaviors. Only Laborers and Team Leaders are liable to experience a Resignation event; the factory’s Shift Managers and Production Director remain in place throughout the entire period.\n- A “Termination” event is like a Resignation behavior, except that the employee was fired by the organization (i.e., the employee experienced an involuntary separation).\n- An “Onboarding” event indicates that the subject is a newly hired employee who began work on the given date. In order to maintain a stable size for the factory’s workforce, a new employee is hired whenever an existing employee has resigned or been terminated. The new employee assumes the organizational role vacated by the recently separated worker (i.e., having the same Shift, Team, and Role), although his or her personal characteristics may differ greatly from those of the person whom he or she is replacing.\n- An “Idea” event occurs when an employee imagines some innovative new approach to solving a long-standing problem or otherwise improving the factory’s functioning. Workers with a high Perceptiveness stat are more likely to generate an Idea behavior.\n- A “Lapse” behavior occurs when a worker makes some severe mental mistake that negatively impacts the factory’s functioning (e.g., by omitting some step from a business process or ordering the wrong parts). Workers with a low Perceptiveness stat are more likely to generate a Lapse behavior, which makes it the (negative) counterpart of an Idea.\n- A “Feat” behavior occurs when an employee performs some exceptional act dependent on physical skill (e.g., expertly manipulating some high-precision tool or sorting objects into bins with remarkable speed). Workers with a high Dexterity stat are more likely to generate a Feat behavior.\n- A “Slip” behavior occurs when an employee experiences some accident or misstep resulting from a lack of physical adroitness (e.g., knocking over a storage rack or dropping some delicate instrument). Workers with a low Dexterity stat are more likely to generate a Slip behavior, which makes it the (negative) counterpart of a Feat.\n- A “Teamwork” behavior occurs when an employee goes to exceptional lengths to encourage, teach, or otherwise support his or her colleagues in some way. Workers with a high Sociality stat are more likely to generate a Teamwork behavior.\n- A “Disruption” behavior occurs when an employee quarrels with colleagues, belligerently rejects a supervisor’s request, or otherwise displays a hostile attitude toward his or her coworkers. Workers with a low Sociality stat are more likely to generate a Disruption behavior, which makes it the (negative) counterpart of a Teamwork.\n- A “Sacrifice” behavior occurs when a worker performs – of his or her own initiative – some action that’s unpleasant or inconvenient for the employee but which spares others from suffering the same hardship (e.g., volunteering to take on some grueling or unpleasant assignment that no one else wants to do). Workers with a high Goodness stat are more likely to generate a Sacrifice behavior.\n- A “Sabotage” behavior occurs when an employee knowingly performs some act (typically, with the hope that he or she won’t be observed while doing so) that will damage equipment, spoil products, or otherwise lessen the organization’s productivity or harm its brand image. Such events are rare but serious occurrences. Workers with a low Goodness stat are more likely to generate a Sabotage behavior, which makes it the (negative) counterpart of a Sacrifice.\n\n# Organizational structure\nAt any given moment, the factory’s workforce comprises 508 persons, including 1 Production Director who oversees the entire factory; 3 Shift Managers; 24 Team Leaders (8 for each shift); and 480 Laborers (who are divided into teams of 24 teams of 20 persons). The Production Director has subordinates but no supervisor, while Laborers have a supervisor but no subordinates. Each Laborer reports to a particular Team Leader; each Team Leader reports to a single Shift Manager; and all of the Shift Managers report to the Production Director.\n\n# Interpreting a row of the dataset\nEach row of the dataset contains 42 fields, which comprise three main elements.\n- SUBJECT-RELATED FIELDS. Some fields relate to the person who is the subject of the row’s event. This employee is the subordinate who performed some particular type of workplace behavior. Fields relating to the subject include `sub ID`, `sub fname`, `sub lname`, `sub age`, `sub sex`, `sub shift`, `sub team`, `sub role`, `sub coll IDs`, `sub colls same sex prtn`, `sub health h`, `sub commitment h`, `sub perceptiveness h`, `sub dexterity h`, `sub sociality h`, `sub goodness h`, `sub strength h`, `sub openmindedness h`, and `sub workstyle h`. All of the fields ending with ` h` are “hidden” fields that reflect some portion of an employee’s internal psychological makeup. These values influence the kinds of behaviors that an employee generates; however, the employee’s supervisor has no direct access to or knowledge of these values; an employee’s supervisor can only attempt to observe and record those external behaviors that are actually performed by the employee in the workplace.\n- SUPERVISOR-RELATED FIELDS. Some fields relate to supervisor of the employee who is the subject of the row’s event. This supervisor is the person who observed the employee performing some workplace behavior and then made a record of it in the factory’s HRM/ERP system. Fields relating to the supervisor include `sup ID`, `sup fname`, `sup lname`, `sup age`, `sup sub age diff`, `sup sex`, `sup role`, `sup commitment h`, `sup perceptiveness h`, and `sup goodness h`.\n- EVENT-RELATED FIELDS. Some fields relate to the unique event that is reflected in the given row. In most cases, the event is grounded in a particular behavior that was performed by the employee who is the subject of the event. The fields `event date`, `event week in series`, `event day in series`, `event weekday num`, and `event weekday name` indicate when the event occurred. The field `behav comptype h` indicates the type of behavior that was actually performed by the worker. In the case of a Resignation behavior, the field `behav cause h` indicates the actual reason why the employee quit his or her job. In the case of an Efficacy event, the field `actual efficacy h` indicates the actual level of Efficacy displayed by the worker on the given day. (Note that these last three fields end with ` h`, to indicate that their contents are, in theory, “hidden” from persons who only have access to the factory’s HRM/ERP system.) The field `record comptype` indicates the type of entry (if any) that was made in the factory’s HRM/ERP system by the employee’s supervisor, to document the behavior that the employee had performed. In the case of a Termination event, the field `record cause` indicates the reason why the supervisor terminated the worker’s employment. In the case of an Efficacy event, the field `recorded efficacy` indicates the estimated level of Efficacy attributed to the worker by his or her supervisor on the given day. The field `recorded note from sup` contains an optional written commentary added to the HRM/ERP system entry by the subject’s supervisor. In most cases, a supervisor will attentively notice and accurately record the fact that a worker had performed a given type of qualitative behavior, in which case the `record conf matrix h` field will have the value “True Positive”. However, a supervisor may on occasion fail to notice or record a worker’s behavior, in which case the `record comptype`, `record cause`, `recorded efficacy`, and `recorded note from sup` fields will be empty and the `record conf matrix h` field will have the value “False Negative”, reflecting the “missing” record that the supervisor should ideally have made.",
  "datasetId": 2245197,
  "datasetSlug": "factory-workers-daily-performance-attrition-s",
  "hasDatasetSlug": true,
  "ownerUser": "gladdenme",
  "hasOwnerUser": true,
  "usabilityRating": 1.0,
  "hasUsabilityRating": true,
  "totalViews": 8451,
  "totalVotes": 9,
  "totalDownloads": 1010,
  "title": "Factory Workers’ Daily Performance & Attrition",
  "hasTitle": true,
  "subtitle": "Data with rich causal relationships, for testing machine-learning approaches",
  "hasSubtitle": true,
  "description": "This synthetic dataset contains 18 months’ worth of daily performance and attrition data (411,948 observations) for a factory whose organizational structure comprises 508 workers. Due to employee turnover, a total of 687 persons appear in the dataset. The dataset’s observations cover both regular daily events (like workers’ attendance and daily level of Efficacy) and special one-time events (like accidents, an employee’s termination, or the onboarding of a new employee). A unique feature of the dataset is diverse causal relationships “hidden” within the data that are waiting to be uncovered through machine learning. For example, one might apply machine learning to investigate:\n- How a worker’s high level of performance increases the likelihood that he or she will be “hired away” to a better job by a competing company.\n- How a worker’s mental lapses or physical accidents may indicate that he or she is becoming sick and may soon miss a day of work due to illness.\n- How workers’ Efficacy is influenced by the day of the week, day of the month, and month of the year.\n- How workers’ age impacts their average daily Efficacy.\n- How workers’ average daily Efficacy is influenced by the difference in age between them and their supervisor.\n- How a worker’s average daily Efficacy is influenced by whether he or she is working primarily with teammates of the same or opposite sex.\n- How the number of “Teamwork” and “Disruption” behaviors displayed by workers and recorded by their managers is influenced by the day of the month (and, e.g., the stress caused by impending production deadlines).\n- How workers can be classified into groups with high, moderate, or low daily Efficacy that is either relatively stable or highly variable.\n\nThe dataset was prepared using [Synaptans WorkforceSim](https://pypi.org/project/workforcesim) version 0.3.15.\n\n# Types of observations\nEach row of the dataset reflects a single “event” that occurred on a particular day in relation to a particular worker. It’s possible for a given worker to have more than one event (and row) for the same day; for example, a worker might have “Presence”, “Efficacy”, and “Teamwork” events on the same day, with each event reflecting a different qualitative or quantitative aspect of the person’s performance. There are 14 types of events reflected in the dataset:\n- A “Presence” event indicates that a particular worker showed up for work on the given day, while an “Absence” event indicates that the worker failed to show up on a day when he or she was scheduled to work.\n- An “Efficacy” event reflects the degree of efficiency and productivity that an employee demonstrated over the course of the given workday. There are two related elements: the actual Efficacy that the employee generated on the given day, and the recorded Efficacy that the worker’s supervisor entered into the factory’s HRM/ERP system for the employee for that day. The employee’s actual Efficacy (a float with four post-decimal digits, such as 0.9548) is a “hidden” variable whose precise value isn’t known to the employee’s manager. Instead, the manager observes the employee over the course of the day and, at the end of the workday, enters into the HRM/ERP system an estimated value for the worker’s Efficacy. Such estimated values have only one post-decimal digit (e.g., 0.9). Some managers are better than others at estimating their employees’ Efficacy scores – but no supervisor is perfect. For example, if an employee worked with an Efficacy of 0.8437 on a given day, his or her manager could easily record an estimated value of 0.8 or 0.9 or (less likely) even 0.7 or 1.0. Workers who feel as though their managers are consistently mis-recording their Efficacy levels may eventually become inclined to quit their jobs.\n- A “Resignation” event indicates that on the given date, an employee quit his or her job (i.e., the employee experienced a voluntary separation). After resigning, the employee was no longer a part of the workforce and did not generate any future behaviors. Only Laborers and Team Leaders are liable to experience a Resignation event; the factory’s Shift Managers and Production Director remain in place throughout the entire period.\n- A “Termination” event is like a Resignation behavior, except that the employee was fired by the organization (i.e., the employee experienced an involuntary separation).\n- An “Onboarding” event indicates that the subject is a newly hired employee who began work on the given date. In order to maintain a stable size for the factory’s workforce, a new employee is hired whenever an existing employee has resigned or been terminated. The new employee assumes the organizational role vacated by the recently separated worker (i.e., having the same Shift, Team, and Role), although his or her personal characteristics may differ greatly from those of the person whom he or she is replacing.\n- An “Idea” event occurs when an employee imagines some innovative new approach to solving a long-standing problem or otherwise improving the factory’s functioning. Workers with a high Perceptiveness stat are more likely to generate an Idea behavior.\n- A “Lapse” behavior occurs when a worker makes some severe mental mistake that negatively impacts the factory’s functioning (e.g., by omitting some step from a business process or ordering the wrong parts). Workers with a low Perceptiveness stat are more likely to generate a Lapse behavior, which makes it the (negative) counterpart of an Idea.\n- A “Feat” behavior occurs when an employee performs some exceptional act dependent on physical skill (e.g., expertly manipulating some high-precision tool or sorting objects into bins with remarkable speed). Workers with a high Dexterity stat are more likely to generate a Feat behavior.\n- A “Slip” behavior occurs when an employee experiences some accident or misstep resulting from a lack of physical adroitness (e.g., knocking over a storage rack or dropping some delicate instrument). Workers with a low Dexterity stat are more likely to generate a Slip behavior, which makes it the (negative) counterpart of a Feat.\n- A “Teamwork” behavior occurs when an employee goes to exceptional lengths to encourage, teach, or otherwise support his or her colleagues in some way. Workers with a high Sociality stat are more likely to generate a Teamwork behavior.\n- A “Disruption” behavior occurs when an employee quarrels with colleagues, belligerently rejects a supervisor’s request, or otherwise displays a hostile attitude toward his or her coworkers. Workers with a low Sociality stat are more likely to generate a Disruption behavior, which makes it the (negative) counterpart of a Teamwork.\n- A “Sacrifice” behavior occurs when a worker performs – of his or her own initiative – some action that’s unpleasant or inconvenient for the employee but which spares others from suffering the same hardship (e.g., volunteering to take on some grueling or unpleasant assignment that no one else wants to do). Workers with a high Goodness stat are more likely to generate a Sacrifice behavior.\n- A “Sabotage” behavior occurs when an employee knowingly performs some act (typically, with the hope that he or she won’t be observed while doing so) that will damage equipment, spoil products, or otherwise lessen the organization’s productivity or harm its brand image. Such events are rare but serious occurrences. Workers with a low Goodness stat are more likely to generate a Sabotage behavior, which makes it the (negative) counterpart of a Sacrifice.\n\n# Organizational structure\nAt any given moment, the factory’s workforce comprises 508 persons, including 1 Production Director who oversees the entire factory; 3 Shift Managers; 24 Team Leaders (8 for each shift); and 480 Laborers (who are divided into teams of 24 teams of 20 persons). The Production Director has subordinates but no supervisor, while Laborers have a supervisor but no subordinates. Each Laborer reports to a particular Team Leader; each Team Leader reports to a single Shift Manager; and all of the Shift Managers report to the Production Director.\n\n# Interpreting a row of the dataset\nEach row of the dataset contains 42 fields, which comprise three main elements.\n- SUBJECT-RELATED FIELDS. Some fields relate to the person who is the subject of the row’s event. This employee is the subordinate who performed some particular type of workplace behavior. Fields relating to the subject include `sub ID`, `sub fname`, `sub lname`, `sub age`, `sub sex`, `sub shift`, `sub team`, `sub role`, `sub coll IDs`, `sub colls same sex prtn`, `sub health h`, `sub commitment h`, `sub perceptiveness h`, `sub dexterity h`, `sub sociality h`, `sub goodness h`, `sub strength h`, `sub openmindedness h`, and `sub workstyle h`. All of the fields ending with ` h` are “hidden” fields that reflect some portion of an employee’s internal psychological makeup. These values influence the kinds of behaviors that an employee generates; however, the employee’s supervisor has no direct access to or knowledge of these values; an employee’s supervisor can only attempt to observe and record those external behaviors that are actually performed by the employee in the workplace.\n- SUPERVISOR-RELATED FIELDS. Some fields relate to supervisor of the employee who is the subject of the row’s event. This supervisor is the person who observed the employee performing some workplace behavior and then made a record of it in the factory’s HRM/ERP system. Fields relating to the supervisor include `sup ID`, `sup fname`, `sup lname`, `sup age`, `sup sub age diff`, `sup sex`, `sup role`, `sup commitment h`, `sup perceptiveness h`, and `sup goodness h`.\n- EVENT-RELATED FIELDS. Some fields relate to the unique event that is reflected in the given row. In most cases, the event is grounded in a particular behavior that was performed by the employee who is the subject of the event. The fields `event date`, `event week in series`, `event day in series`, `event weekday num`, and `event weekday name` indicate when the event occurred. The field `behav comptype h` indicates the type of behavior that was actually performed by the worker. In the case of a Resignation behavior, the field `behav cause h` indicates the actual reason why the employee quit his or her job. In the case of an Efficacy event, the field `actual efficacy h` indicates the actual level of Efficacy displayed by the worker on the given day. (Note that these last three fields end with ` h`, to indicate that their contents are, in theory, “hidden” from persons who only have access to the factory’s HRM/ERP system.) The field `record comptype` indicates the type of entry (if any) that was made in the factory’s HRM/ERP system by the employee’s supervisor, to document the behavior that the employee had performed. In the case of a Termination event, the field `record cause` indicates the reason why the supervisor terminated the worker’s employment. In the case of an Efficacy event, the field `recorded efficacy` indicates the estimated level of Efficacy attributed to the worker by his or her supervisor on the given day. The field `recorded note from sup` contains an optional written commentary added to the HRM/ERP system entry by the subject’s supervisor. In most cases, a supervisor will attentively notice and accurately record the fact that a worker had performed a given type of qualitative behavior, in which case the `record conf matrix h` field will have the value “True Positive”. However, a supervisor may on occasion fail to notice or record a worker’s behavior, in which case the `record comptype`, `record cause`, `recorded efficacy`, and `recorded note from sup` fields will be empty and the `record conf matrix h` field will have the value “False Negative”, reflecting the “missing” record that the supervisor should ideally have made.",
  "hasDescription": true,
  "isPrivate": false,
  "keywords": [
    "employment",
    "business",
    "manufacturing",
    "time series analysis",
    "model comparison"
  ],
  "licenses": [
    {
      "nameNullable": "CC-BY-SA-4.0",
      "name": "CC-BY-SA-4.0",
      "hasName": true
    }
  ],
  "collaborators": [],
  "data": []
}